Catalogs/МашиночитаемыеДоверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МашиночитаемыеДоверенности</Name>
			<Comment>МЧД универсального формата, для B2B и B2G</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Полномочие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПолномочияЭЦП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МашиночитаемыеДоверенности/Ext/ManagerModule.bsl
// Возвращает уникальный идентификатор первой актуальной МЧД пользователя
//
// Параметры:
//  ОГРН		 - Число, Строка				 - ОГРН
//  Пользователь - СправочникСсылка.Пользователи - Пользвоатель
// 
// Возвращаемое значение:
//  Строка, Неопределено - строка УИД, если действующая МЧД найдена, иначе Неопределено
//
Функция ПолучитьУИДМЧД(ОГРН, Полномочия = Неопределено, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МашиночитаемыеДоверенности.УИД КАК УИД
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенности КАК МашиночитаемыеДоверенности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенности.Полномочия КАК ПолномочияМЧД
		|		ПО (ПолномочияМЧД.Ссылка = МашиночитаемыеДоверенности.Ссылка)
		|			И (&Полномочия = НЕОПРЕДЕЛЕНО
		|				ИЛИ ПолномочияМЧД.Полномочие = &Полномочия)
		|			И (НЕ МашиночитаемыеДоверенности.ПометкаУдаления)
		|			И (МашиночитаемыеДоверенности.Пользователь = &Пользователь)
		|			И (&Дата МЕЖДУ МашиночитаемыеДоверенности.ДатаВыдачи И МашиночитаемыеДоверенности.ДатаОкончания)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО (Организации.Ссылка = МашиночитаемыеДоверенности.Организация)
		|			И (Организации.ОГРН = &ОГРН)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организации.ПометкаУдаления,
		|	МашиночитаемыеДоверенности.ДатаВыдачи";
	
	Запрос.УстановитьПараметр("ОГРН",			Формат(ОГРН,"ЧГ=0"));
	Запрос.УстановитьПараметр("Пользователь",	Пользователь);
	Запрос.УстановитьПараметр("Дата",			ТекущаяДата());
	Запрос.УстановитьПараметр("Полномочия",		Полномочия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УИД;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
